cedbossneo/Mowgli/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
/**
 ******************************************************************************
 * @file    cpp_main.c
 * @author  Georg Swoboda <cn@warp.at>
 * @date    21/09/2022
 * @version 1.0.0
 * @brief   ROS Node main C++ routines
 ******************************************************************************
 * Main ROS routines
 * Publish/Subscribe to Topics
 * Provide Services
 * Odometry (for DR)
 ******************************************************************************
 */

#include "board.h"
#include "main.h"
#include "adc.h"

#include <cpp_main.h>
#include "panel.h"
#include "emergency.h"
#include "drivemotor.h"
#include "blademotor.h"
#include "ultrasonic_sensor.h"
#include "stm32f1xx_hal.h"
#include "ringbuffer.h"
#include <micro_ros_platformio.h>
#include <rcl/rcl.h>
#include <rclc/rclc.h>
#include <rclc/executor.h>
#include "tf/tf.h"
#include "tf/transform_broadcaster.h"
#include "std_msgs/Bool.h"
#include "std_msgs/String.h"
#include "std_msgs/Float32.h"
#include "std_msgs/Int16.h"
#include "std_msgs/UInt8.h"
#include "std_msgs/UInt16.h"
#include "std_msgs/UInt32.h"
#include "std_msgs/Int16MultiArray.h"
#include "nav_msgs/Odometry.h"
#include "nbt.h"
#include "geometry_msgs/Twist.h"
#include "std_srvs/SetBool.h"
#include "std_srvs/Empty.h"

// IMU
#include "imu/imu.h"
#include "sensor_msgs/Imu.h"
#include "sensor_msgs/Range.h"
#include "sensor_msgs/Temperature.h"

// Flash Configuration Services
#include "mowgli/SetCfg.h"
#include "mowgli/GetCfg.h"
#include "mowgli/Led.h"

// Status message
#include "mowgli/status.h"
#include "mowgli/WheelTick.h"

#include "mower_msgs/Status.h"
#include "mower_msgs/MowerControlSrv.h"
#include "mower_msgs/EmergencyStopSrv.h"
#include "mower_msgs/HighLevelControlSrv.h"
#include "mower_msgs/HighLevelStatus.h"

#define RCCHECK(fn) { rcl_ret_t temp_rc = fn; if((temp_rc != RCL_RET_OK)){error_loop();}}
#define RCSOFTCHECK(fn) { rcl_ret_t temp_rc = fn; if((temp_rc != RCL_RET_OK)){}}

#ifdef OPTION_PERIMETER
	#include "perimeter.h"
	#include "mower_msgs/Perimeter.h"
	#include "mower_msgs/PerimeterControlSrv.h"
#endif

#define ODOM_NBT_TIME_MS 100
#define IMU_NBT_TIME_MS 20
#define MOTORS_NBT_TIME_MS 20
#define STATUS_NBT_TIME_MS 250

uint8_t RxBuffer[RxBufferSize];
struct ringbuffer rb;

struct timespec last_cmd_vel;
uint32_t last_cmd_vel_age; // age of last velocity command

// drive motor control
static uint8_t left_speed = 0;
static uint8_t right_speed = 0;
static uint8_t left_dir = 0;
static uint8_t right_dir = 0;

// blade motor control
static uint8_t blade_on_off = 0;
static uint8_t blade_direction = 0;

rclc_executor_t executor;
rclc_support_t support;
rcl_allocator_t allocator;
rcl_node_t node;
rcl_timer_t timer;

float imu_onboard_temperature; // cached temp value, so we dont poll I2C constantly

std_msgs::Int16MultiArray buttonstate_msg;

#if OPTION_ULTRASONIC == 1
/* ultrasonic sensors */
sensor_msgs::Range ultrasonic_left_msg;
sensor_msgs::Range ultrasonic_right_msg;
#endif
#if OPTION_BUMPER == 1
/* bumper sensors */
sensor_msgs::Range bumper_left_msg;
sensor_msgs::Range bumper_right_msg;
#endif

// IMU
// external IMU (i2c)
sensor_msgs::Imu imu_msg;
// onboard IMU (accelerometer and temp)
sensor_msgs::Imu imu_onboard_msg;
// sensor_msgs::Temperature imu_onboard_temp_msg;

// mowgli status message
mowgli::status status_msg;
// om status message
mower_msgs::Status om_mower_status_msg;

xbot_msgs::WheelTick wheel_ticks_msg;
mower_msgs::HighLevelStatus high_level_status;
float clamp(float d, float min, float max);
/*
 * PUBLISHERS
 */
rcl_publisher_t pubButtonState; 
rcl_publisher_t pubOMStatus; 
rcl_publisher_t pubWheelTicks; 
#ifdef ROS_PUBLISH_MOWGLI
ros::Publisher pubStatus("mowgli/status", &status_msg);
#endif

// IMU external
rcl_publisher_t pubIMU; 

#if OPTION_ULTRASONIC == 1
ros::Publisher pubLeftUltrasonic("ultrasonic/left", &ultrasonic_left_msg);
ros::Publisher pubRightUltrasonic("ultrasonic/right", &ultrasonic_left_msg);
#endif

#if OPTION_BUMPER == 1
ros::Publisher pubLeftBumper("bumper/left", &bumper_left_msg);
ros::Publisher pubRightBumper("bumper/right", &bumper_left_msg);
#endif

/*
 * SUBSCRIBERS
 */
extern "C" void CommandVelocityMessageCb(const geometry_msgs::Twist &msg);
extern "C" void CommandHighLevelStatusMessageCb(const mower_msgs::HighLevelStatus &msg);
rcl_subscription_t  subCommandVelocity;
rcl_subscription_t  subCommandHighLevelStatus;

// SERVICES
void cbSetCfg(const mowgli::SetCfgRequest &req, mowgli::SetCfgResponse &res);
void cbGetCfg(const mowgli::GetCfgRequest &req, mowgli::GetCfgResponse &res);
void cbEnableMowerMotor(const mower_msgs::MowerControlSrvRequest &req, mower_msgs::MowerControlSrvResponse &res);
void cbSetEmergency(const mower_msgs::EmergencyStopSrvRequest &req, mower_msgs::EmergencyStopSrvResponse &res);
void cbReboot(const std_srvs::Empty::Request &req, std_srvs::Empty::Response &res);

// ros::ServiceServer<mowgli::SetCfgRequest, mowgli::SetCfgResponse> svcSetCfg("mowgli/SetCfg", cbSetCfg);
// ros::ServiceServer<mowgli::GetCfgRequest, mowgli::GetCfgResponse> svcGetCfg("mowgli/GetCfg", cbGetCfg);
rcl_client_t svcHighLevelControl;
rcl_service_t svcEnableMowerMotor;
rcl_service_t svcSetEmergency;
rcl_service_t svcReboot;

#ifdef OPTION_PERIMETER
// om perimeter signal
mower_msgs::Perimeter om_perimeter_msg;
void cbPerimeterListen(const mower_msgs::PerimeterControlSrvRequest &req, mower_msgs::PerimeterControlSrvResponse &res);
ros::Publisher pubPerimeter("mower/perimeter",&om_perimeter_msg);
ros::ServiceServer<mower_msgs::PerimeterControlSrvRequest, mower_msgs::PerimeterControlSrvResponse> svcPerimeterListen("mower_service/perimeter_listen",cbPerimeterListen);
#endif

/*
 * NON BLOCKING TIMERS
 */
static nbt_t ros_nbt;
static nbt_t publish_nbt;
static nbt_t motors_nbt;
static nbt_t panel_nbt;
static nbt_t imu_nbt;
static nbt_t status_nbt;

/*
 * reboot flag, if true we reboot after next publish_nbt
 */
static bool reboot_flag = false;

extern "C" void CommandHighLevelStatusMessageCb(const mower_msgs::HighLevelStatus &msg)
{
	high_level_status = msg;
	if (msg.gps_quality_percent < 0.9)
	{
		PANEL_Set_LED(PANEL_LED_LOCK, PANEL_LED_OFF);
	}
	else
	{
		PANEL_Set_LED(PANEL_LED_LOCK, PANEL_LED_ON);
	}
	if (blade_on_off)
	{
		if (BLADEMOTOR_bActivated)
		{
			#ifdef PANEL_LED_2H
			PANEL_Set_LED(PANEL_LED_2H, PANEL_LED_FLASH_SLOW);
			#endif
		}
		else
		{
			#ifdef PANEL_LED_2H
			PANEL_Set_LED(PANEL_LED_2H, PANEL_LED_ON);
			#endif
		}
	}
	else
	{
		#ifdef PANEL_LED_2H
		PANEL_Set_LED(PANEL_LED_2H, PANEL_LED_OFF);
		#endif			
	}

