cedbossneo/Mowgli/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
	}
	// if (NBT_handler(&status_nbt))
}

/*
 *  callback for mowgli/EnableMowerMotor Service
 */
void cbEnableMowerMotor(const mower_msgs::MowerControlSrvRequest &req, mower_msgs::MowerControlSrvResponse &res)
{
	if (req.mow_enabled && !Emergency_State())
	{
		blade_on_off = 1;
		blade_direction = req.mow_direction;
	}
	else
	{
		blade_on_off = 0;
	}
}

/*
 * callback for set emergency state by remote
 */
void cbSetEmergency(const mower_msgs::EmergencyStopSrvRequest &req, mower_msgs::EmergencyStopSrvResponse &res)
{
	Emergency_SetState(req.emergency);
}

#ifdef OPTION_PERIMETER
void cbPerimeterListen(const mower_msgs::PerimeterControlSrvRequest &req, mower_msgs::PerimeterControlSrvResponse &res) {
	Perimeter_ListenOn(req.listenOn);
}
#endif

/*
 *  callback for mowgli/Reboot Service
 */
void cbReboot(const std_srvs::Empty::Request &req, std_srvs::Empty::Response &res)
{
	// debug_printf("cbReboot:\r\n");
	reboot_flag = true;
}

/*
 * ROS housekeeping
 */
extern "C" void spinOnce()
{
	if (NBT_handler(&ros_nbt))
	{
		rclc_executor_spin(&executor);
#if OPTION_BUMPER == 1
		bumper_left_msg.header.stamp = nh.now();
		bumper_left_msg.header.frame_id = "bumper_left_link";
		bumper_right_msg.header.stamp = nh.now();
		bumper_right_msg.header.frame_id = "bumper_right_link";

		bumper_left_msg.radiation_type = 0;
		bumper_left_msg.field_of_view = 1.64; /* 90°*/
		bumper_left_msg.min_range = 0.0;
		bumper_left_msg.max_range = 0.20;
		bumper_left_msg.range = HALLSTOP_Left_Sense() * 0.05;

		bumper_right_msg.radiation_type = 0;
		bumper_right_msg.field_of_view = 1.64; /* 90°*/
		bumper_right_msg.min_range = 0.0;
		bumper_right_msg.max_range = 0.20;
		bumper_right_msg.range = HALLSTOP_Right_Sense() * 0.05;

		RCSOFTCHECK(rcl_publish(pubLeftBumper, &bumper_left_msg, NULL));
		RCSOFTCHECK(rcl_publish(pubRightBumper, &bumper_right_msg, NULL));
#endif
	}
}

/*
 *  Initialize rosserial
 */
extern "C" void init_ROS()
{
	ringbuffer_init(&rb, RxBuffer, RxBufferSize);

	// Initialize ROS
	Serial.begin(115200);
	set_microros_serial_transports(Serial);
	delay(2000);

	allocator = rcl_get_default_allocator();

	//create init_options
	RCCHECK(rclc_support_init(&support, 0, NULL, &allocator));

	// create node
	RCCHECK(rclc_node_init_default(&node, "mowgli", "", &support));

	RCCHECK(rclc_publisher_init_default(
    &pubButtonState,
    &node,
    ROSIDL_GET_MSG_TYPE_SUPPORT(std_msgs, msg, Int16MultiArray),
    "buttonstate"));
	
	RCCHECK(rclc_publisher_init_default(
    &pubOMStatus,
    &node,
    ROSIDL_GET_MSG_TYPE_SUPPORT(mower_msgs, msg, Status),
    "mower/status"));
	
	RCCHECK(rclc_publisher_init_default(
    &pubWheelTicks,
    &node,
    ROSIDL_GET_MSG_TYPE_SUPPORT(xbot_msgs, msg, WheelTick),
    "mower/wheel_ticks"));
	
	RCCHECK(rclc_publisher_init_default(
    &pubIMU,
    &node,
    ROSIDL_GET_MSG_TYPE_SUPPORT(sensor_msgs, msg, Imu),
    "imu/data_raw"));
	/*set max time to 10ms to give some time to the other functions*/
	// nh.setSpinTimeout(10);
#if OPTION_ULTRASONIC == 1
	nh.advertise(pubLeftUltrasonic);
	nh.advertise(pubRightUltrasonic);
#endif
#if OPTION_BUMPER == 1
	nh.advertise(pubLeftBumper);
	nh.advertise(pubRightBumper);
#endif

	//nh.advertise(pubButtonState);
	//nh.advertise(pubIMU);
#ifdef ROS_PUBLISH_MOWGLI
	nh.advertise(pubStatus);
#endif
	//nh.advertise(pubOMStatus);
	//nh.advertise(pubWheelTicks);

	// Initialize Subscribers
	//("mower_logic/current_state", CommandHighLevelStatusMessageCb)
	//("cmd_vel", CommandVelocityMessageCb)
	/*
	ros::Subscriber<geometry_msgs::Twist> subCommandVelocity("cmd_vel", CommandVelocityMessageCb);
ros::Subscriber<mower_msgs::HighLevelStatus> subCommandHighLevelStatus("mower_logic/current_state", CommandHighLevelStatusMessageCb);
*/
	RCCHECK(rclc_subscription_init_default(
		&subCommandVelocity,
		&node,
		ROSIDL_GET_MSG_TYPE_SUPPORT(geometry_msgs, msg, Twist),
		"cmd_vel"));
	RCCHECK(rclc_subscription_init_default(
		&subCommandHighLevelStatus,
		&node,
		ROSIDL_GET_MSG_TYPE_SUPPORT(mower_msgs, msg, HighLevelStatus),
		"mower_logic/current_state"));

	// Initialize Services
	// nh.advertiseService(svcSetCfg);
	// nh.advertiseService(svcGetCfg);
	/*
	ros::ServiceServer<mower_msgs::MowerControlSrvRequest, mower_msgs::MowerControlSrvResponse> svcEnableMowerMotor("mower_service/mow_enabled", cbEnableMowerMotor);
ros::ServiceServer<mower_msgs::EmergencyStopSrvRequest, mower_msgs::EmergencyStopSrvResponse> svcSetEmergency("mower_service/emergency", cbSetEmergency);
ros::ServiceClient<mower_msgs::HighLevelControlSrvRequest, mower_msgs::HighLevelControlSrvResponse> svcHighLevelControl("mower_service/high_level_control");
ros::ServiceServer<std_srvs::Empty::Request, std_srvs::Empty::Response> svcReboot("mowgli/Reboot", cbReboot);
*/
	RCCHECK(rclc_service_init_default(&service, &node, ROSIDL_GET_SRV_TYPE_SUPPORT(mower_msgs, srv, MowerControlSrv), "/mower_service/mow_enabled"));
	RCCHECK(rclc_service_init_default(&service, &node, ROSIDL_GET_SRV_TYPE_SUPPORT(mower_msgs, srv, EmergencyStopSrv), "/mower_service/emergency"));
	RCCHECK(rclc_service_init_default(&service, &node, ROSIDL_GET_SRV_TYPE_SUPPORT(mower_msgs, srv, AddTwoInts), "/mowgli/Reboot"));
	RCCHECK(rclc_client_init_default(&client, &node, ROSIDL_GET_SRV_TYPE_SUPPORT(std_srvs, srv, Empty), "/mower_service/high_level_control"));

#ifdef OPTION_PERIMETER
	nh.advertise(pubPerimeter);
	nh.advertiseService(svcPerimeterListen);
#endif

  // create executor
	  RCCHECK(rclc_executor_init(&executor, &support.context, 1, &allocator));
	// Initialize Timers
	NBT_init(&publish_nbt, 1000);
	NBT_init(&panel_nbt, 100);
	NBT_init(&status_nbt, STATUS_NBT_TIME_MS);
	NBT_init(&imu_nbt, IMU_NBT_TIME_MS);
	NBT_init(&motors_nbt, MOTORS_NBT_TIME_MS);
	NBT_init(&ros_nbt, 10);
}

float clamp(float d, float min, float max)
{
	const float t = d < min ? min : d;
	return t > max ? max : t;
}
